Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.Name
The name of the non-continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters.
-or-
When setting this property: The name name is not valid for the non-continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019